Revit 2026 API
RebarPropagation Class
 An utility class containing functions that can be used to propagate rebar elements.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Structure.RebarPropagation
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)
Syntax
public static class RebarPropagation
Public NotInheritable Class RebarPropagation
public ref class RebarPropagation abstract sealed
[<AbstractClassAttribute>]
[<SealedAttribute>]
type RebarPropagation = class end
The RebarPropagation type exposes the following members.
Methods
Name | Description
AlignByFace
AlignByHost
Top
See Also
Reference
Autodesk.Revit.DB.Structure Namespace